Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/visa_requirements_for_entering_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Visa requirements for entering Ireland
ga: Riachtanais víosa le teacht isteach in Éirinn

source: • Who needs an entry visa?
ga: • An bhfuil víosa iontrála de dhíth orm?

source: People from certain countries need a valid Irish entry visa before arriving in the State, whether by air, sea or land
ga: Tá víosa iontrála bailí de dhíth ar dhaoine ó thíortha áirithe roimh theacht isteach sa Stát dóibh, bíodh sin bealach an aeir, na farraige nó an talaimh

source: An Irish visa is a certificate placed on your passport or travel document to indicate that you are authorised to land in the State subject to any other conditions of landing being fulfilled
ga: Is greamaitheoir é víosa a chuirtear ar do phas nó do dhoiciméad taistil le léiriú go bhfuil tú údaraithe le teacht i dtír sa Stát ar an gcoinníoll go bhfuil aon choinníollacha iontrála eile a bheith comhlíonta

source: This means that you will still be subject to immigration control at the point of entry to the State even if you have a visa
ga: Ciallaíonn sé seo go mbeidh tú faoi réir rialaithe inimirce ag pointe iontrála sa Stát fiú má tá víosa agat

source: You may also need to register with the immigration authorities
ga: B’fhéidir go mbeadh ort clárú leis na húdaráis inimirce chomh maith

source: Who needs an entry visa?
ga: An bhfuil víosa iontrála de dhíth orm?

source: You do not need a visa to land in Ireland if you are a citizen of the EEA or of one of the countries listed in the table in 'Further information' below
ga: Más saoránach thú den LEE, nó d’aon cheann de na tíortha atá liostaithe sa tábla i 'Tuilleadh faisnéise' thíos, níl víosa de dhíth ortle teacht i dtír in Éirinn

source: The list of countries whose citizens do not require a visa to enter Ireland is defined in the Immigration Act 2004 (Visas) Order 2014 (SI 473/2014) as amended by SI 175/2015 and SI 513/2015
ga: Tá sainmhíniú ar liosta na dtíortha nach bhfuil víosa de dhíth orthu le teacht isteach in Éirinn i Acht Inimirce 2004 (Víosaí) Ordú 2014 (IR 473/2014) arna leasú ag IR 175/2015 agus IR 513/2015

source: Who else can land in Ireland without a visa?
ga: Cé eile a bhfuil cead acu teacht i dtír in Éirinn gan víosa?

source: You do not need a visa to land in Ireland if:
ga: Níl víosa de dhíth ort le teacht i dtír in Éirinn más amhlaidh:

source: • You hold a valid travel document issued in accordance with Article 28 of the Geneva Convention
ga: • Tá doiciméad taistil bailí i do sheilbh a eisíodh de réir Alt 28 de Choinbhinsiún na Ginéive

source: • You hold either a valid residence card 4 EU FAM or a valid permanent residence card 4 EU FAM issued under the European Communities (Free Movement of Persons) Regulations 2015
ga: • Tá cárta bailí cónaí 4 EU FAM agat nó cárta buanchónaitheachta 4 EU FAM agat a d'éisigh faoi Rialacháin na gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015

source: • You are a family member of an EU citizen and you hold a document called "Residence card of a family member of a Union citizen"
ga: • Is ball teaghlaigh saoránaigh AE thú agus tá doiciméad agat dá ngairtear "Cárta cónaí bhaill teaghlaigh saoránaigh Aontais"

source: You will need a visa if you are a citizen of one of the countries whose nationals require a visa to enter Ireland
ga: Má saoránach de cheann de na tíortha a bhfuil víosa de dhíth ar a náisiúnaigh, beidh víosa de dhíth ort nuair a thaistealaíonn tú go hÉirinn

source: You can find detailed information on the application procedures on the website of the Irish Naturalisation and Immigration Service (INIS)
ga: Tá mionfaisnéis faoi na nósanna imeachta iarrtais ar shuíomh na Seirbhíse Eadóírsithe agus Inimirce na hÉireann (SEIÉ)

source: It is advisable to consult their website before applying for your visa, to make sure that you have the most up-to-date information
ga: Moltar súil a chaitheamh ar a láithreán gréasáin sula ndéanann tú iarratas ar víosa, lena chinntiú go bhfuil an fhaisnéis is cothroime le dáta agat

source: You can read this list of frequently asked questions about visas
ga: Féadfaidh tú an liosta seo de cheisteanna coitianta faoi víosaí a léamh

source: Family member of EU national: If you are a non-EEA national coming to Ireland from another EU country as a dependant of an EU national, and you do not hold a document called "Residence card of a family member of a Union citizen", you may need a visa when you first travel to Ireland
ga: Cleithiúnach saoránaigh de chuid an AE: Más náisiúnaigh neamh-Lee thú ag teacht go hÉirinn ó thír eile de chuid an AE mar chleithiúnach saoránaigh de chuid an AE, agus nach bhfuil doiciméad agat dá ngairtear "Cárta cónaí baill teaghlaigh saoránaigh Aontais", d’fhéadfadh go mbeidh víosa de dhíth ort nuair a thaistealaíonn tú go hÉirinn don chéad uair

source: If you plan to stay for more than 3 months, you should register with the immigration authorities and apply for a residence card
ga: Má tá plean agat fanacht níos faide ná 3 mhí, ba cheart duit clarú leis na húdaráis inimirce agus iarratas a chur isteach ar chárta cónaithe

source: If you receive a residence card, you will not need a re-entry visa for travel into Ireland in future
ga: Má fhaigheann tú cárta cónaithe, beidh víosa athiontrála de dhíth ort le taisteal go hÉirinn san am atá le teacht

source: If you wish to visit Ireland for a period of less than 3 months, for example, on holidays, to pursue a short course of studies or for business meetings, then you can apply for a short stay ‘C’ visa for either a single entry or multiple entries
ga: Más mian leat cuairt a thabhairt ar Éirinn ar feadh tréimhse níos giorra ná 3 mhí, mar shampla, laethanta saoire a chaitheamh, tabhairt faoi ghearrchúrsa staidéar nó freastal ar chruinnithe gnó, féadfaidh tú iarratas a dhéanamh ar víosa gearchuairte ‘C’ d’iontráil singil nó d’iliontrálacha

source: The maximum stay allowed under a short stay ‘C’ visa is 90 days
ga: Is í an fanacht uasta a cheadaítear faoi víosa gearrchuairte ‘C’ ná 90 lá

source: If you enter the State on a ‘C’ visa you cannot have your permission to remain in the State extended
ga: Má iontrálann tú an Stát ar víosa ‘C’, ní féidir leat síneadh a chur ar an gcead atá agat chun fanacht sa Stát

source: You must leave and reapply from outside the State if you want to return
ga: Ní mór duit fágáil agus iarratas eile a dhéanamh lasmuigh den Stát más mian leat filleadh

source: If you wish to travel to Ireland for more than 3 months, for example to pursue a course of study, for work or to settle permanently in Ireland with family members who are already resident in Ireland, then you can apply for a long stay ‘D’ visa for a single entry
ga: Más mian leat taisteal go hÉirinn ar feadh breis agus 3 mhí, mar shampla, chun tabhairt faoi chúrsa staidéir, chun oibriú nó chun cónaí go buan in Éirinn le daoine muinteartha a chónaíonn in Éirinn cheana féin, féadfaidh tú iarratas a dhéanamh ar víosa fadchuairte ‘D’ d’iontráil singil

source: If you are granted a long stay ‘D’ visa and wish to remain in the State for longer than 3 months, or beyond the period of leave granted to you by an Immigration Officer at an Irish port of entry you will be required to register and obtain a residence permit
ga: Má dheonaítear víosa fadchuairte ‘D’ duit agus más mian leat fanacht sa Stát ar feadh breis agus 3 mhí, nó i ndiaidh na tréimhse ceada a dheonaigh Oifigeach Inimirce duit ag port iontrála Éireannach, beidh ort clárú agus cead cónaitheachta a fháil

source: You can read more information about the different types of visas, including tourist visas, business visas and student visas
ga: Tá níos mó faisnéise ar fáil faoi cineálacha víosaí chomh maith víosaí turasóireachta, víosaí gnó and víosaí mac léinn

source: People from a small number of countries also need a transit visa when arriving in Ireland on their way to another country
ga: Tá víosa aistrithe de dhíth ar dhaoine ó líon beag tíortha chomh maith nuair a thagann siad go hÉirinn ar a mbealach chuig tír eile

source: A transit visa does not permit you to leave the port or airport
ga: Ní ligeann víosa aistrithe duit an port nó aerphort a fhágáil

source: If you are a citizen of one of the following countries, you will need a valid Irish transit visa when landing in the State:
ga: Más saoránach thú de cheann de na tíortha seo a leanas, beidh víosa bailí aistrithe Éireannaigh de dhíth ort agus tú ag teacht i dtír sa Stát:

source: Countries that require an Irish transit visa
ga: │an Afganastáin │an Iaráic │

source: │Democratic Republic of the Congo │Nigeria │
ga: │an Eiritré │an tSomáil │

source: │Ethiopia – see also SI 175/2015 (pdf) │Sri Lanka │
ga: │féach IR 175/2015 (pdf) │ │

source: Visa waiver and reciprocal visa arrangement
ga: Tarscaoilte víosa agus socrú cómhalartach víosa

source: The Short Stay Visa Waiver Programme allows nationals of a number of Eastern European, Middle Eastern and Asian countries who have a short-term UK visa, to come to Ireland without the need for a separate Irish visa
ga: Ceadaíonn Clár Tarscaoilte Víosa Gearrchónaithe náisiúnaigh de thíortha áirithe san Oirthear na hEorpa, sa Mheánoirthear agus san Áise le víosa gearrchónaithe RA acu teacht in Éirinn gan gá víosa Éireannach ar leith

source: The Programme has been extended to 31 October 2021
ga: Síntear an Clár go dtí 31 Mean Fómhair 2021

source: Under a new British Irish Visa Scheme (BIVS), visitors from China can travel freely within the Common Travel Area, (that is, Ireland and the UK, but not the Channel Islands and the Isle of Man), using either an Irish or UK short-stay visa endorsed with 'BIVS'
ga: Faoi Scéim Víosa na Breataine-Éireann (BIVS), féadfaidh cuairteoirí ón tSín taisteal gan srian laistigh den Comhlimistéar Taistil, (is é sin, Éire agus an RA, ach amháin Oileáin Mhuir nIocht nó Manainn ), agus víosa gearrchuairte na hÉireann nó na RA atá formhuinithe le ‘BIVS’ a úsáid

source: Since 9 February 2015 the Scheme has been extended to visitors from India
ga: Ó 9 Feabhra 2015, síníodh an scéim go cuardaitheoirí ón India

source: The Scheme operates through a reciprocal visa arrangement, whereby Ireland and the UK recognise short-stay visas issued by the other for travel to their jurisdiction
ga: Oibrítear an Scéim trí shocrú cómhalartach víosa, ina n-aithníonn Éire agus an RA víosaí gearrchuairte a d’eisigh an tír eile go ndéanfaidh daoine taisteal chuig a ndlínse

source: The first visa issued to you is valid for a single entry to the State
ga: Níl an chéad víosa a eisíodh duit bailí ach d'aon iontráil amháin isteach sa Stát

source: If you wish to leave the State for a short period of time you must apply for a re-entry visa
ga: Más mian leat an Stát a fhágáil ar feadh tréimhse ghearr caithfidh tú cur isteach ar víosa athiontrála

source: This includes travel to Northern Ireland when you will need a re-entry visa to re-enter the State
ga: Baineann sé seo freisin leis an taisteal go Tuaisceart Éireann; beidh gá agat le víosa athiontrála le teacht ar ais sa Stát

source: Before you can get a re-entry visa you must be registered with the Garda National Immigration Bureau (GNIB)
ga: Le go bhféadfaidh tú víosa athiontrála a fháil ní mór duit a bheith cláraithe le Biúró Náisiúnta an Gharda Síochána um Inimirce (BNGSI)

source: The standard non-refundable visa application processing fees are:
ga: Is iad seo na táillí próiseála caighdeánacha neamh-in-aisíoctha d’iarratais ar víosa:

source: Entry and re-entry visas
ga: Víosaí iontrála agus athiontrála

source: A single journey visa costs €60 and will be valid for one entry to the State up to a maximum of 90 days from the date of issue
ga: Cosnaíonn víosa aistir shingil €60 agus beidh sé bailí d’iontráil amháin chuig an Stát a fhad le 90 lá tar éis dháta na heisiúna

source: A multi journey visa costs €100 and will be valid for multiple entries to the State up to a maximum of 5 years from the date of issue
ga: Cosnaíonn víosa ilaistir €100 agus beidh sé bailí d’iontrálacha iolracha chuig an Stát a mhéid a fhad 5 bliana tar éis dháta na heisiúna

source: A transit visa costs €25
ga: Cosnaíonn víosa idirthurais €25

source: There may also be communications charges in some cases
ga: B’fhéidir go mbeadh táillí cumarsáide ann i roinnt cásanna

source: Information about these charges, and on the fee in your local currency, is available from your local Irish embassy or consulate
ga: Tá faisnéis faoi na táillí seo, agus faoin táille san airgead áitiúil s’agatsa, ar fáil ó d’Ambasáid nó Consalacht Éireannach áitiúil

source: Who does not pay the fee?
ga: Cé nach n-íocann an táille?

source: Some applicants are not required to pay a fee
ga: Ní bheidh ar iarratasóirí áirithe táille a íoc

source: This includes visa-required spouses and certain family members of EEA citizens (including Irish nationals) provided that proof of the relationship is provided with the application
ga: Cuimsíonn sé seo céilí a bhfuil víosa de dhíth orthu agus baill teaghlaigh áirithe de chuid saoránaigh LEE (lena n-áirítear saoránaigh Éireannacha) ar an gcoinníoll go gcuirtear cruthúnas den ghaol ar fáil leis an iarratas

source: In addition, applicants from some countries are not required to pay a fee
ga: Lena chois sin, níl riachtanas ar iarratasóirí ó thíortha áirithe táille a íoc

source: As this changes from time to time, you should check with your local Irish embassy or consulate, or with the Visa Office - see 'Where to apply'.
ga: Ós rud é go n-athraíonn sé seo ó am go ham, ba cheart duit seiceáil le hAmbasáid áitiúil nó le Consalacht áitiúil na hÉireann, nó le hOifig na Víosaí – féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Nationals of the countries covered by the Short-stay Visa Waiver Programme who are long-term legal residents of the UK or the Schengen area will still require a visa but will not have to pay the visa fee
ga: Ní gá do náisiúnaigh de na tíortha faoi chumhdach an Chláir Tarscaoilte Víosa Gearrchónaithe, atá ina gcónaí go dlíthiúil sa RA nó sa limistéar Schengen an táille víosa a íoc ach is gá díobh víosa a bheith acu fós

source: You must apply for a visa online unless you are resident in Ireland and applying for a re-entry visa - see below
ga: Caithfidh tú cur isteach ar an víosa ar líne mura bhfuil tú i do chónaí in Éirinn agus ag déanamh iarratais ar víosa athiontrála - féach thíos

source: There is information on how to complete an online application in English (pdf) as well as in Arabic (pdf), Chinese (pdf), Russian (pdf), Hindi (pdf), French (pdf), Turkish (pdf) and Urdu (pdf)
ga: Tá faisnéis le fáil faoi mar is féidir iarratas ar-líne a chomhlánú i mBéarla (pdf) agus in Araibis (pdf), i Sínis (pdf), i Rúisis (pdf), i bhFraincis (pdf), i dTuircis (pdf), i Hiondúis (pdf) agus in Urdais (pdf)

source: You should apply at least 8 weeks before you plan to come to Ireland
ga: Ba cheart duit an t-iarratas a dhéanamh 8 seachtain ar a laghad roimh an dáta a bhfuil rún agat teacht go hÉirinn

source: Details of the photographic requirements and current processing times are on the INIS website
ga: Tá mionsonraí faoi na riachtanais maidir le grianghraif agus amanna próiseála ar shuíomh SEIÉ

source: Biometric data: All visa applicants residing in Nigeria must provide biometric data
ga: Sonraí bithmhéadracha: Ní mór do gach iarratasóir víosa atá ina chónaí sa Nigéir sonraí bithmhéadracha a sholáthar

source: Applicants residing in Pakistan and China must provide fingerprints
ga: Ní mór do gach iarratasóir víosa atá ina chónaí sa tSín agus sa Phacastáin méarloirg a sholáthar

source: You can find information about biometric data on the INIS website
ga: Tá tuilleadh faisnéise faoi shonraí bithmhéadracha ar fáil ar an suíomh gréasáin SEIÉ

source: Minors: From 13 October 2014, the Irish visa sticker issued to a minor (aged under 18) will identify whether they are travelling with a parent, guardian or other adult or are travelling unaccompanied
ga: Mionaoiseach: Ó 13 Deireadh Fómhair 2014, sainaithníonn an greamán víosa Éireannach eisithe do mhionaoiseach (faoi bhun aois 18) go bhfuil siad ag taisteal le tuismitheoir, le caomhnóir nó le duine fásta eile nó go bhfuil siad ag taisteal gan tionlacan

source: This sticker will also be on Irish C visas issued to minors from 7 December 2015
ga: Beidh an greamán ar víosaí Éireannach eisithe do mhionaoiseacha ó 7 Nollaig 2015 freisin

source: Appeals: If you are refused a visa you can appeal the decision by writing to the Visa Appeals Officer at the INIS Visa Section - see 'Where to apply' below
ga: Achomhairc: Má tá d'iarratas diúltaithe is féidir achomharc a dhéanamh chuig an oifeagach achomharc sa Rannán Víosaí - féach 'Cá háit a ndéanfaidh mé iarratas thíos.'

source: Before making any travel arrangements you apply to the Visa Office of INIS by registered post using the re-entry visa application form. If you wish to apply in person at the Visa Office you must book an appointment online. Where to apply
ga: Sula ndéanfaidh tú socrú taistil ar bith, déanann tú iarratas le hOifig Víosaí SEIÉ trí phost cláraithe ag baint úsáide duit as an bhfoirm iarratais ar víosa athiontrála

source: Countries whose citizens are not required to be in possession of a valid Irish visa
ga: Más mian leat iarratas a dhéanamh go pearsanta chuig Oifig Víosaí, ní mór duit coinne a chur in áirithe ar líne
